lib/tasks/dev.rake

SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://static.mercadobitcoin.com.br/web/img/icons/assets/ico-asset-btc-color.svg"], ["LIMIT", 1]]
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---
  task add_coins: :environment do # call: rails dev:add_coins
    coins = [ # Variável coins recebe um array de hashes para cadastrar no banco
      {
        description:  "Bitcoin",
        acronym:      "BTC",
        url_image:    "https://static.mercadobitcoin.com.br/web/img/icons/assets/ico-asset-btc-color.svg",
        mining_type: MiningType.find_by(acronym: 'PoW') # find_by: Procura no banco o acronym que corresponde com Pow)
      },
      {
        description:  "Ethereum",
        acronym:      "ETH",
        url_image:    "https://static.mercadobitcoin.com.br/web/img/icons/assets/ico-asset-eth-color.svg",
        mining_type: MiningType.all.sample # all.sample: Busca um valor aleatório
      },
      {
        description:  "Pendle",
        acronym:      "PENDLE",
        url_image:    "https://static.mercadobitcoin.com.br/web/img/icons/assets/ico-asset-pendle-color.svg",
        mining_type: MiningType.all.sample
      }
    ]

    coins.each do |coin| # Percorre o array de hashes e cadastra no banco de um a um
      Coin.find_or_create_by!(coin) # Se tiver duvidas de como escreve a variável, verifique nos models

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2024-11-02 13:59:15.970515"], ["updated_at", "2024-11-02 13:59:15.970515"]]
---
  task add_mining_types: :environment do
    mining_types = [
      { description: "Proof of Work",      acronym:"PoW" },
      { description: "Proof of Stake",     acronym:"PoS" },
      { description: "Proof of Capacity",  acronym:"PoC" }
    ]

    mining_types.each do |mining_type|
      MiningType.find_or_create_by!(mining_type) # Se tiver duvidas de como escreve a variável, verifique nos models