app/controllers/coins_controller.rb

UPDATE "coins" SET "url_image" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["url_image", "https://static.mercadobitcoin.com.br/web/img/icons/assets/ico-asset-eth-color.svg"], ["updated_at", "2024-10-22 01:24:13.691115"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"
---
    def set_mining_type_options
      @mining_type_options = MiningType.all.pluck(:description, :id) # Acessa o model e armazena os dados em uma variável de sessão, invocada em before_action