app/views/coins/index.html.erb

<%# Caso tenha mais de uma moeda, o título aparece "Moedas" ao invés de "Moeda". %>
<h1><%= Coin.model_name.human(count: @coins.count) %></h1>
---
SELECT "coins".* FROM "coins"
SELECT COUNT(*) FROM "coins"